
## Plan Result

[CI link](https://github.com/NaokiYazawa/aws-ecs-terraform/actions/runs/3813231539)


<pre><code>Plan: 1 to add, 0 to change, 0 to destroy.</code></pre>

* Create
  * aws_ecs_cluster.ecs_cluster


<details><summary>Change Result (Click me)</summary>

```hcl

  # aws_ecs_cluster.ecs_cluster will be created
  + resource "aws_ecs_cluster" "ecs_cluster" {
      + arn                = (known after apply)
      + capacity_providers = (known after apply)
      + id                 = (known after apply)
      + name               = "go-simple-server"
      + tags_all           = (known after apply)

      + default_capacity_provider_strategy {
          + base              = (known after apply)
          + capacity_provider = (known after apply)
          + weight            = (known after apply)
        }

      + setting {
          + name  = (known after apply)
          + value = (known after apply)
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","JobName":"terraform","PRNumber":10,"Program":"tfcmt","SHA1":"11258a8853d244d32b5b00631a789ffe0495e44b","Vars":{},"WorkflowName":"Terraform"} -->